Базовая строка:
from math import log2, ceil, floor
N - кол-во символов в алфавите!!!!!!!!!
i - вес одного символа в битах!!!!!!!!
то есть сколько символов(разрядов) имеет КАЖДЫЙ для минимального кодирования в бинарке!!!!

Условие:
1) При регистрации в компьютерной системе каждому пользователю выдаётся пароль, состоящий из 15 символов и содержащий
только символы Е, Г, Э, 2, 0, 2, 4.
Каждый такой пароль в компьютерной программе записывается минимально возможным и одинаковым целым количеством байт
(при этом используют посимвольное кодирование и все символы кодируются одинаковым и минимально возможным количеством бит).
Определите объём памяти в байтах, отводимый этой программой для записи 25 паролей.
Решение:
from math import log2, ceil, floor

K = 15
N = 6
i = ceil(log2(N))
I1 = ceil(i * K / 8)
n = 25
I2 = I1 * n
print(ceil(I2))

Условие:
2) При регистрации в компьютерной системе каждому пользователю выдаётся пароль, состоящий из 7 символов и содержащий
только символы из 10-символьного набора: А, В, C, D, Е, F, G, H, К, T.
В базе данных для хранения сведений о каждом пользователе отведено одинаковое и минимально возможное целое число байт.
При этом используют посимвольное кодирование паролей, все символы кодируют одинаковым и минимально возможным количеством бит.
Кроме собственно пароля, для каждого пользователя в системе хранятся дополнительные сведения, для чего отведено 16 байт на одного пользователя.
Определите объём памяти (в байтах), необходимый для хранения сведений о 20 пользователях.
Решение:
from math import log2, ceil, floor

K = 7
N = 10
i = ceil(log2(N))
I1 = ceil(K * i / 8)
I2 = 16
n = 20
I0 = (I1 + I2) * n
print(I0)

Условие:
При регистрации в компьютерной системе каждому пользователю выдаётся идентификатор, состоящий из 32 символов и
содержащий символы из 310 символьного набора. В базе данных для хранения идентификатора о каждом пользователе
отведено одинаковое и минимально возможное целое число байт. При этом используют посимвольное кодирование, все
символы кодируют одинаковым и минимально возможным количеством бит. Кроме идентификатора, для каждого пользователя
в системе хранятся дополнительные сведения, для чего выделено целое число байт одинаковое для каждого пользователя.
Для хранения сведений о 256 пользователях выделили 15 Кбайт. Сколько байт можно использовать для хранения
дополнительных сведений о каждом пользователе?
Решение:
from math import log2, ceil, floor

K = 32
N = 311
i = ceil(log2(N))
n = 256
I1 = n * i * K / 8
I0 = 15 * 1024
print((I0 - I1) / n)

Условие:
Каждый объект, зарегистрированный в информационной системе,
получает уникальный код из трёх частей. Первая часть кода определяет категорию объекта.
Всего выделяется 6 категорий, которые обозначаются латинскими буквами A, B, C, D, E, F.
Вторая часть кода описывает группу, к которой принадлежит объект.
Эта часть состоит из 11 символов, каждый из которых может быть любой из 20 заглавных латинских букв
(буквы, задающие категории, не используются).
Третья часть кода задаёт порядковый номер объекта внутри категории и может быть целым числом от 1 до 1999.
Каждая из трёх частей кодируется независимо. Для представления категории и группы используют посимвольное кодирование,
все символы в пределах каждой части кода кодируют одинаковым минимально возможным количеством битов.
Порядковый номер кодируется как двоичное целое число с использованием минимально возможного количества битов.
Для кода в целом выделяется минимально возможное целое количество байтов. Кроме того,
для каждого объекта выделен одинаковый объём памяти для хранения дополнительных регистрационных данных.
Для хранения кода и дополнительных регистрационных данных 36 объектов потребовалось 1188 байт.
Сколько байтов выделено для хранения дополнительных регистрационных данных одного объекта?
В ответе запишите только целое число – количество байтов.
Решение:
from math import ceil, log2

N1 = 6
K1 = 1
i1 = ceil(log2(N1))

N2 = 20
K2 = 11
i2 = ceil(log2(N2))

N3 = 2000
K3 = 1
i3 = ceil(log2(N3))

n = 36
I0 = 1188

I1 = I0 / n
I2 = ceil((K1 * i1 + K2 * i2 + K3 * i3) / 8)
print(I1 - I2)

Условие:
На предприятии каждой изготовленной детали присваивается серийный номер,
содержащий десятичные цифры, 26 латинских букв (без учёта регистра) и
символы из 470-символьного специального алфавита.
В базе данных для хранения каждого серийного номера отведено одинаковое и минимально возможное число байт.
При этом используется посимвольное кодирование серийных номеров, все символы кодируются одинаковым
и минимально возможным числом бит.
Известно, что для хранения 708 серийных номеров отведено более 213 Кбайт памяти.
Определите минимально возможную длину серийного номера.

В ответе запишите только целое число.
Решение:
from math import ceil, log2

N = 10 + 26 + 470
i = ceil(log2(N))
n = 708
I0 = 213 * 1024 * 8  # в битах
I1 = ceil(I0 / n)  # на одного юзера
print(ceil(I1 / i))

Условие:
На предприятии каждой изготовленной детали присваивают серийный номер,
содержащий десятичные цифры, 52 латинские буквы (с учётом регистра) и
символы из 1000-символьного специального алфавита.
В базе данных для хранения каждого серийного номера отведено одинаковое и минимально возможное число байт.
При этом используется посимвольное кодирование серийных номеров,
все символы кодируются одинаковым и минимально возможным числом бит.
Известно, что для хранения 2000 серийных номеров отведено не более 693 Кбайт памяти.
Определите максимально возможную длину серийного номера.
В ответе запишите только целое число.
Решение:
from math import ceil, log2, floor

N = 10 + 52 + 963
i = ceil(log2(N))
n = 2000
I0 = 693 * 1024
for k in range(1000, 10, -1):
    if ceil(k * i / 8) * 2000 <= I0:
        print(k)
        break

Условие:
На предприятии каждой изготовленной детали присваивают серийный номер, состоящий из 1231 символов.
Для его хранения отведено одинаковое и минимально возможное число байт.
При этом используется посимвольное кодирование серийных номеров,
все символы кодируются одинаковым и минимально возможным числом бит.
Известно, что для хранения 523872 серийных номеров отведено более 432 Мбайт памяти.
Определите минимально возможную мощность алфавита, из которого составляются серийные номера.
В ответе запишите только число.
Решение:
from math import ceil, log2, floor

from math import ceil, log2, floor

K = 1231
n = 523872
I0 = 432 * 1024 * 1024 * 8  # в битах
i = floor(I0 / (n * K))
print(2 ** i + 1)  # просят минимальное, i у нас равно 6, а при 33 символах кодируем 6 битами


Условие:
Датчик считывает значения интенсивности поступающего света.
Известно, что при считывании значение округляется до одного из 2000 возможных.
Каждое считанное значение кодируется одинаковым минимально возможным количеством бит.
Также известно, что значения считываются сериями по 50 измерений.
Каждая такая серия сохраняется на жесткий диск, на котором занимает целое количество байт.
Если последняя переданная серия меньше 50 значений,
переданные в ней значения также сохраняются в файле с помощью минимального целого количества байт.
За время своей работы датчик считал 12312 значений.
Найдите минимальное целое количество килобайт,
которого хватит для хранения считанных значений.
В качестве ответа запишите одно число – найденное количество килобайт.
Решение:
from math import ceil, log2, floor

N = 2000
i = ceil(log2(N))
K = 50
n = 12320
I1 = 0
while n < 50:  # цикл для того, чтобы отловить блок с длиной не равно 50
    I1 += ceil(i * K / 8)
    n -= 50
I1 += ceil(i * n / 8)  # тот самый блок, где количество записей меньше 50
print(ceil(I1 / 1024))
