Базовая строка:
from math import log2, ceil, floor
N - кол-во символов в алфавите!!!!!!!!!
i - вес одного символа в битах!!!!!!!!
то есть сколько символов(разрядов) имеет КАЖДЫЙ для минимального кодирования в бинарке!!!!

Условие:
1) При регистрации в компьютерной системе каждому пользователю выдаётся пароль, состоящий из 15 символов и содержащий
только символы Е, Г, Э, 2, 0, 2, 4.
Каждый такой пароль в компьютерной программе записывается минимально возможным и одинаковым целым количеством байт
(при этом используют посимвольное кодирование и все символы кодируются одинаковым и минимально возможным количеством бит).
Определите объём памяти в байтах, отводимый этой программой для записи 25 паролей.
Решение:
from math import log2, ceil, floor

K = 15
N = 6
i = ceil(log2(N))
I1 = ceil(i * K / 8)
n = 25
I2 = I1 * n
print(ceil(I2))

Условие:
2) При регистрации в компьютерной системе каждому пользователю выдаётся пароль, состоящий из 7 символов и содержащий
только символы из 10-символьного набора: А, В, C, D, Е, F, G, H, К, T.
В базе данных для хранения сведений о каждом пользователе отведено одинаковое и минимально возможное целое число байт.
При этом используют посимвольное кодирование паролей, все символы кодируют одинаковым и минимально возможным количеством бит.
Кроме собственно пароля, для каждого пользователя в системе хранятся дополнительные сведения, для чего отведено 16 байт на одного пользователя.
Определите объём памяти (в байтах), необходимый для хранения сведений о 20 пользователях.
Решение:
from math import log2, ceil, floor

K = 7
N = 10
i = ceil(log2(N))
I1 = ceil(K * i / 8)
I2 = 16
n = 20
I0 = (I1 + I2) * n
print(I0)

Условие:
При регистрации в компьютерной системе каждому пользователю выдаётся идентификатор, состоящий из 32 символов и
содержащий символы из 310 символьного набора. В базе данных для хранения идентификатора о каждом пользователе
отведено одинаковое и минимально возможное целое число байт. При этом используют посимвольное кодирование, все
символы кодируют одинаковым и минимально возможным количеством бит. Кроме идентификатора, для каждого пользователя
в системе хранятся дополнительные сведения, для чего выделено целое число байт одинаковое для каждого пользователя.
Для хранения сведений о 256 пользователях выделили 15 Кбайт. Сколько байт можно использовать для хранения
дополнительных сведений о каждом пользователе?
Решение:
from math import log2, ceil, floor

K = 32
N = 311
i = ceil(log2(N))
n = 256
I1 = n * i * K / 8
I0 = 15 * 1024
print((I0 - I1) / n)

Условие:
Бот получает информацию об ответах на задания.
Каждый ответ находится в диапазоне от 1 до 100 000.
Ответ кодируется с помощью минимального целого количества бит.
Ответы сохраняются в файлы по 100 штук.
Такой файл записывается с помощью минимального целого количества байт.
К каждому файлу добавляется заголовок весом 4 байта.
В последнем файле за месяц, может быть меньше 100 ответов,
такой файл также сохраняется минимальным целым количеством байт.
За месяц бот получил информацию о 28400 ответах,
определите минимальное целое количество Кбайт необходимое для сохранения всех файлов.
Решение:
from math import log2, ceil

N = 100000  # не тривиально, но у нас просто получается 100000 РАЗНЫХ паролей
i = ceil(log2(N))
n = 28400
I0 = 0
while n > 100:
    n -= 100
    I0 += ceil(100 * i / 8) + 4
I0 += ceil(n * i / 8) + 3
print(ceil(I0 / 1024))

Условие:
При регистрации в компьютерной системе каждому пользователю выдаётся пароль, состоящий из 11 символов.
В качестве символов используют прописные и строчные буквы латинского алфавита, а также десятичные цифры.
В базе данных для хранения сведений о каждом пользователе отведено одинаковое и минимально возможное целое число байт.
При этом используют посимвольное кодирование паролей, все символы кодируют одинаковым и минимально возможным количеством бит.
Кроме собственно пароля, для каждого пользователя в системе хранятся дополнительные сведения, для чего выделено 28 байт на одного пользователя.
В компьютерной системе отведено 20 Кбайт для хранения сведений о пользователях.
О каком наибольшем количестве пользователей может быть сохранена информация в системе?
В ответе запишите только целое число – количество пользователей.
Решение:
from math import ceil, log2

K = 11
N = 26 + 26 + 10
i = ceil(log2(N))
I1 = 28  # dop (bytes)
I0 = 20 * 1024
IM = 0
n = 0
while IM <= I0:
    IM += (I1 + ((i * K) / 8))
    n += 1
print(n - 1)  # вывожу -1 потому что в цикле мы привысили максимальное максимум на 1ого пользователя

Условие:
При регистрации в компьютерной системе каждому пользователю выдаётся идентификатор,
состоящий из 10 символов, первый из которых – одна из 18 букв, а остальные – цифры
(допускается использование 10 десятичных цифр).
Каждый такой идентификатор в компьютерной программе записывается минимально возможным и одинаковым целым количеством байт
(при этом используют посимвольное кодирование; все цифры кодируются одинаковым и минимально возможным количеством бит,
все буквы также кодируются одинаковым и минимально возможным количеством бит).
Определите объём памяти в байтах, отводимый этой программой для записи 25 идентификаторов.
Решение:
from math import log2, ceil

N1 = 18
N2 = 10
K1 = 2
K2 = 8
n = 25
i1 = ceil(log2(N1))
i2 = ceil(log2(N2))
I = ceil((i1 * K1 + i2 * K2) / 8)  # чисто по кайфу находим кобинации, разделив пароль на два мелких
print(I * n)
