Условие:
Два игрока, Петя и Ваня, играют в следующую игру.
Перед игроками лежит куча камней.
Игроки ходят по очереди, первый ход делает Петя.
За один ход игрок может добавить в кучу два камня или увеличить количество камней в куче в два раза.
Например, имея кучу из 15 камней, за один ход можно получить кучу из 17 или 30 камней.
У каждого игрока, чтобы делать ходы, есть неограниченное количество камней.
Игра завершается в тот момент, когда количество камней в куче становится не менее 25.
Победителем считается игрок, сделавший последний ход, то есть первым получивший кучу, в которой будет 25 или больше камней.
В начальный момент в куче было S камней, 1 ≤ S ≤ 24.
Решение:
game_over = 25


def fn(x, c, pob):
    if x >= 25 or c > max(pob):
        return c in pob
    moves = [fn(x + 2, c + 1, pob), fn(x * 2, c + 1, pob)]
    if c % 2 == max(pob) % 2:
        return all(moves)
    else:
        return any(moves)


for s in range(1, game_over):
    if not fn(s, 0, [1]) and fn(s, 0, [2]):
        print(s)
print()
for s in range(1, game_over):
    if not fn(s, 0, [1]) and fn(s, 0, [3]):
        print(s)
print()
for s in range(1, game_over):
    if not fn(s, 0, [2]) and fn(s, 0, [2, 4]):
        print(s)


Условие:
Два игрока, Петя и Ваня, играют в следующую игру.
Перед игроками лежит куча камней.
Игроки ходят по очереди, первый ход делает Петя.
За один ход игрок может добавить в кучу один или четыре камня или увеличить количество камней в куче в три раза.
Чтобы делать ходы, у каждого игрока есть неограниченное количество камней.
Игра завершается, когда количество камней в куче становится не менее 88.
Победителем считается игрок, сделавший последний ход, то есть первым получивший кучу, в которой будет 88 или больше камней.
В начальный момент в куче было S камней, 1 ≤ S ≤ 87.
Задание 19.
Найдите такое значение S, при котором Петя не может выиграть за один ход, но Ваня выигрывает своим первым ходом после любого хода Пети.
Задание 20.
Найдите два наименьших значения S, когда Петя имеет выигрышную стратегию, причём одновременно выполняются два условия:
﻿﻿Петя не может выиграть за один ход;
﻿﻿Петя может выиграть своим вторым ходом независимо от того, как будет ходить Ваня.
Найденные значения запишите в ответе в порядке возрастания через пробел.
Задание 21
Найдите наименьшее значение S, при котором одновременно выполняются два условия:
﻿﻿у Вани есть выигрышная стратегия, позволяющая ему выиграть первым или вторым ходом при любой игре Пети;
﻿﻿у Вани нет стратегии, которая позволит ему гарантированно выиграть первым ходом.
Решение:
game_over = 88


def fn(x, c, pob):
    if x >= game_over or c > max(pob):
        return c in pob
    moves = [fn(x + 1, c + 1, pob), fn(x * 3, c + 1, pob), fn(x + 4, c + 1, pob)]
    if c % 2 == max(pob) % 2:
        return all(moves)
    else:
        return any(moves)


for s in range(1, game_over):
    if not fn(s, 0, [1]) and fn(s, 0, [2]):
        print(s)
print()
for s in range(1, game_over):
    if not fn(s, 0, [1]) and fn(s, 0, [3]):
        print(s)
print()
for s in range(1, game_over):
    if not fn(s, 0, [2]) and fn(s, 0, [2, 4]):
        print(s)

Условие:
Два игрока, Петя и Ваня, играют в следующую игру.
Перед игроками лежат две кучи камней.
Игроки ходят по очереди, первый ход делает Петя.
За один ход игрок может добавить в одну из куч (по своему выбору) два камня или увеличить количество камней в куче в два раза.
Игра завершается в тот момент, когда суммарное количество камней в кучах становится не менее 68.
Победителем считается игрок, сделавший последний ход, то есть первым получивший такую позицию, при которой в кучах будет 68 или больше камней.
В начальный момент в первой куче было 7 камней, во второй куче - S камней;
1 ≤ S ≤ 60.
Nº19
Известно, что Ваня выиграл своим первым ходом после неудачного первого хода Пети. Укажите минимальное значение S, когда такая ситуация возможна.
Nº20
Найдите минимальное значение S, при котором у Пети есть выигрышная стратегия, причём одновременно выполняются два условия:
﻿﻿Петя не может выиграть за один ход;
﻿﻿Петя может выиграть своим вторым ходом независимо от того, как будет ходить Ваня.
Nº21
Найдите два значения S, при которых одновременно выполняются два условия:
﻿﻿у Вани есть выигрышная стратегия, позволяющая ему выиграть первым или вторым ходом при любой игре Пети;
﻿﻿у Вани нет стратегии, которая позволит ему гарантированно выиграть первым ходом.
Найденные значения запишите в ответе в порядке возрастания через пробел.
Решение:
game_over = 68


def fn(x1, x2, c, pob, func=all):
    if (x1 + x2) >= game_over or c > max(pob):
        return c in pob
    c += 1
    moves = [fn(x1 + 2, x2, c, pob), fn(x1, x2 + 2, c, pob), fn(x1 * 2, x2, c, pob), fn(x1, x2 * 2, c, pob)]
    if c % 2 == max(pob) % 2:
        return any(moves)
    else:
        return func(moves)

print("#19")
s1 = 7
for s2 in range(1, 61):
    if fn(s1, s2, 0, [2], any):
        print(s2)
        break
print()
print("#20")
for s2 in range(1, 61):
    if not fn(s1, s2, 0, [1], all) and fn(s1, s2, 0, [3], all):
        print(s2)
        break
print()
print("#21")
for s2 in range(1, 61):
    if not fn(s1, s2, 0, [2], all) and fn(s1, s2, 0, [2, 4], all):
        print(s2)
