Условие:
Исполнитель преобразует число на экране.
У исполнителя есть три команды, которые обозначены буквами.
A. Вычесть 1.
B. Разделить на 2.
C. Разделить на 3.
Команда B может быть исполнена только для четного числа, команда C - только для числа, кратного 3.
Программа для исполнителя - это последовательность команд. Траектория вычислений программы - это последовательность результатов выполнения всех команд программы.
Например, для программы BAC при исходном числе 20 траектория вычислений содержит числа 10, 9, 3.
Сколько существует программ, которые преобразуют исходное число 22 в число 1 и при этом траектория вычислений не содержит чисел 10 и 15?
Ответ:
53
Решение:
def f(n, k):
    if n < k or n == 10 or n == 15:
        return 0
    if n == k:
        return 1
    if n > k:
        if n % 2 == 0 and n % 3 == 0:
            return f(n - 1, k) + f(n // 2, k) + f(n // 3, k)
        elif n % 2 == 0:
            return f(n - 1, k) + f(n // 2, k)
        elif n % 3 == 0:
            return f(n - 1, k) + f(n // 3, k)
        else:
            return f(n - 1, k)


print(f(22, 1))

Условие: