Условие:
Алгоритм получает на вход натуральное число N и строит по нему новое число R следующим образом:
- Строится двоичная запись числа N.
- Если сумма цифр десятичной записи заданного числа нечётна, то в конец двоичной записи дописывается 1, если чётна— 0.
- Пункт 2 повторяется для вновь полученных чисел ещё два раза.
- Результатом работы алгоритма становится десятичная запись полученного числа R.
Определите наименьшее возможное значение R > 2025, которое может получиться в результате работы алгоритма.
Ответ: 2027
Решение:
def f(n):
    bn = bin(n)[2:]
    for i in range(3):
        nn = int(bn, 2)
        sb = sum(map(int, str(nn)))
        if sb % 2 != 0:
            bn += '1'
        else:
            bn += '0'
    return int(bn, 2)


for i in range(1, 1000):
    r = f(i)
    if r > 2025:
        print(r, i)
        break

