Номер крайне похож на номер 11
Поэтому:
Базовая строка:
from math import log2, ceil, floor
N - кол-во символов в алфавите!!!!!!!!!
i - вес одного символа в битах!!!!!!!!
то есть сколько символов(разрядов) имеет КАЖДЫЙ для минимального кодирования в бинарке!!!!

Условие:
Какой минимальный объём памяти (в Кбайт) нужно зарезервировать,
чтобы можно было сохранить любое растровое изображение размером 128×128 пикселей при условии,
что в изображении могут использоваться 128 различных цветов?
В ответе запишите только целое число, единицу измерения писать не нужно.
Ответ:
14
Решение:
Какой минимальный объём памяти (в Кбайт) нужно зарезервировать,
чтобы можно было сохранить любое растровое изображение размером 128×128 пикселей при условии,
что в изображении могут использоваться 128 различных цветов?
В ответе запишите только целое число, единицу измерения писать не нужно.

Условие:
После преобразования растрового графического файла его объем уменьшился в 1,5 раза.
Определите наибольшее количество цветов, которое могло быть в палитре первоначально,
если после преобразования было получено растровое изображение того же разрешения в 16-цветной палитре?
Ответ:
64
Решение:
from math import log2

delta = 1.5
N2 = 16
i2 = log2(N2)
i1 = i2 * delta
N1 = 2 ** i1
print(N1)

Условие:
Цветное изображение было оцифровано и сохранено в виде файла без использования сжатия данных.
Размер полученного файла – 54 Мбайт.
Затем то же изображение было оцифровано повторно с разрешением в 2 раза больше и
глубиной кодирования цвета в 3 раза меньше по сравнению с первоначальными параметрами.
Сжатие данных не производилось. Укажите размер файла в Мбайт, полученного при повторной оцифровке.
Ответ:
36
Решение:
I1 = 54 * 1024 * 1024
I2 = I1 * 2 / 3
print(I2 / 1024 / 1024)


Условие:
Камера делает фотоснимки размером 3200×1800 пикселей. На хранение одного кадра отводится 3 Мбайт.
Найдите максимально возможное количество цветов в палитре изображения.
Ответ:
16
Решение:
from math import floor

K = 3200 * 1800
I = 3 * 1024 * 1024 * 8
i = floor(I / K)
N = 2 ** i
print(N)

Условие:
Автоматическая фотокамера делает фотографии высокого разрешения с палитрой, содержащей 2**24 = 16 777 216 цветов.
Средний размер фотографии составляет 15 Мбайт. Для хранения в базе данных фотографии преобразуют в формат с палитрой,
содержащей 256 цветов. Другие преобразования и дополнительные методы сжатия не используются.
Сколько Мбайт составляет средний размер преобразованной фотографии?
Ответ:
5
Решение:
from math import log2

N1 = 2 ** 24
i1 = log2(N1)
I1 = 15 * 1024 * 1024 * 8
K = I1 / i1
N2 = 256
i2 = log2(N2)
I2 = K * i2
print(I2 / 1024 / 1024 / 8)

Условие:
Для хранения в информационной системе документы сканируются с разрешением 600 ppi и цветовой системой, содержащей 224 = 16 777 216 цветов. Методы сжатия изображений не используются. Средний размер отсканированного документа составляет 18 Мбайт. В целях экономии было решено перейти на разрешение 300 ppi и цветовую систему, содержащую 216 = 65 536 цветов. Сколько Мбайт будет составлять средний размер документа, отсканированного с изменёнными параметрами?
Ответ:
6
Решение:
from math import log2, ceil

N1 = 2 ** 24
i1 = ceil(log2(N1))
I0 = 18 * 1024 * 1024 * 8
K1 = I0 / i1
N2 = 2 ** 16
i2 = ceil(log2(N2))
K2 = K1 / 2
print(K2 * i2 / 8 / 1024 / 1024)

Условие:
В информационной системе хранятся изображения размером 2048×1600 пикселей. 
При кодировании используется алгоритм сжатия изображений, 
позволяющий уменьшить размер памяти для хранения одного изображения в среднем в 8 раз 
по сравнению с независимым кодированием каждого пикселя. Каждое изображение дополняется служебной информацией, 
которая занимает 64 Кбайт. Для хранения 32 изображений выделено 12 Мбайт памяти. 
Какое максимальное количество цветов можно использовать в палитре каждого изображения?
Ответ: 128
Решение:
from math import ceil

K = 2048 * 1600
IE = 64 * 1024 * 8
n = 32
I0 = 12 * 1024 * 1024 * 8
k = 8
I1 = I0 / n
IP = I1 - IE
i = ceil(IP * k / K)
print(2 ** i)

Условие:
Для хранения в информационной системе документы сканируются с разрешением 400 ppi. 
Методы сжатия изображений не используются. 
Средний размер отсканированного документа составляет 2 Мбайт. 
В целях экономии было решено перейти на разрешение 100 ppi и цветовую систему, 
содержащую 64 цвета. Средний размер документа, отсканированного с изменёнными параметрами, 
составляет 96 Кбайт. 
Определите количество цветов в палитре до оптимизации.
Ответ: 4294967296
Решение:
from math import ceil, log2

p1 = 400
I1 = 2 * 1024 * 1024 * 8
p2 = 100
N2 = 64
I2 = 96 * 1024 * 8
i2 = log2(N2)
K = I2 / (i2 * p2)
N1 = 2 ** (I1 / (p1 * K))
print(N1)

Условие:
Изображение размером 4х7 дюйма отсканировано с разрешением 300 ppi и использованием 2^24 цветов.
 Заголовок файла занимает 6 Кбайт. 
 Определите, сколько Кбайт памяти необходимо выделить для хранения файла. 
 В ответе введите целое число.
Ответ: 7389
Решение:
from math import log2, ceil

K = 4 * 7 * 300 * 300
N = 2 ** 24
i = log2(N)
IH = 6
print(ceil(K * i / (1024 * 8)) + IH)

Условие:
Для хранения сжатого произвольного растрового изображения размером 800x1024 пикселей 
отведено 300 Кбайт памяти без учёта размера заголовка файла. 
Для кодирования цвета каждого пикселя используется одинаковое количество бит, 
коды пикселей записываются в файл один за другим без промежутков. 
При сохранении данные сжимаются, 
размер итогового файла после сжатия становится на 40% меньше исходного. 
Какое максимальное количество цветов можно использовать в изображении?
Ответ: 32
Решение:
K = 800 * 1024
I0 = 300 * 1024 * 8
k = 0.6
i = I0 / (K * k)
N = 2 ** i
print(N)

Условие:
Для хранения сжатого произвольного растрового изображения размером 640 на 256 пикселей отведено 170 Кбайт
памяти без учёта размера заголовка файла.
Исходный файл изображения больше, чем сжатый, на 35%.
Для кодирования цвета каждого пикселя используется одинаковое количество бит,
коды пикселей записываются в файл один за другим без промежутков.
Какое максимальное количество цветов можно использовать в изображении?
Ответ: 2048
Решение:
K = 640 * 256
I = 170 * 1024 * 8
k = 1.35
I0 = I * k
i = (I0 // K)
print(2 ** i)

Условие:
Фотограф делает цветные фотографии размером 3614×5410 пикселей,
используя палитру из 2**24 цветов.
Для сохранения снимков фотограф использует сменные карты памяти,
каждая из которых вмещает не более 8 Гбайт данных.
Когда на карте остаётся недостаточно места для записи новой фотографии,
фотограф заменяет карту на следующую свободную.
Известно, что фотограф сделал 3215 снимков.
Сколько снимков оказалось на последней карте памяти из использованных?
В ответе запишите целое число.
Ответ: 3
Решение:
from math import floor

K = 3614 * 5410
i = 24
I1 = 8 * 1024 * 1024 * 1024 * 8
n = 3215
I0 = K * i
n1 = floor(I1 / I0)
while n > n1:
    n -= n1
print(n)

Условие:
Голосовое сообщение продолжительностью 90 с было записано в формате стерео
и оцифровано с глубиной кодирования 16 бит и частотой дискретизации 48000 измерений в секунду.
Сжатие данных не использовалось.
Файл с оцифрованным голосовым сообщением был передан по каналу связи, пропускная способность которого 3200 бит/с.
Сколько секунд длилась передача файла?
В ответе запишите целое число, единицу измерения указывать не нужно.
Ответ: 43200
Решение:
n = 2
i = 16
K = 90
f = 48000
sp = 3200
I = n * i * K * f
print(I / sp)

