Небольшая заметка:
1. Можно для удобства делать замену чисел на буквы для последующего удобства
Пример:
Две четные и две нечетные цифры не могут стоять рядом. МОЖНО ЗАМЕНИТЬ ЧЕТНЫЕ НА БУКВУ Ч, А НЕЧЕТНЫЕ НА Н.

2. Строка типа а[0] != a[1] != a[2] ... НЕ РАБОТАЕТ.
ДЛя меня лично удобнее сильно через count, но также можно сделать set и сравнить длину строки с длиной setа.




Условие:
https://3.shkolkovo.online/catalog/4425/6205?SubjectId=30
Решение:
from itertools import *

t = product("НРДО", repeat=4)

for k, i in enumerate(t):
    if ''.join(i) == 'ДРОН':
        print(k + 1)  # тк нумерация с 0

Условие:
Определите количество пятизначных чисел, записанных в девятеричной системе счисления,
в записи которых ровно одна цифра 3, при этом никакая из цифр 5, 6, 7, 8 не стоит рядом с цифрой 3.
Ответ:
6400
Решение:
def f(n, b):
    fin = ''
    numeric = '0123456789'
    while n > 0:
        fin = numeric[n % b] + fin
        n //= b
    return fin
count = 0
for i in range(9 ** 4, 9 ** 5):
    a = f(i, 9)
    if str(a).count('3') == 1 and '53' not in a and '53' not in a and\
        '63' not in a and '73' not in a and '83' not in a and '35' not in a and \
            '36' not in a and '37' not in a and '38' not in a:
        count += 1

print(count)

Условие:

Решение:
from itertools import product

count = 0
a = 'КРОВАТЬ'
ls = list(product(a, repeat=5))
for i in ls:
    if i.count('Р') <= 4 and (len(i) - i.count('Р') + 1 == len(set(i))):
        print(i)
        count += 1

print(count)

Условие:
from itertools import product

count = 0
a = 'САПОГ'
ls = list(product(a, repeat=5))
for i in ls:
    st = ''.join(i)
    if 'АО' not in st and 'ОА' not in st and 'СП' not in st and 'ПС' not in st and \
            'ПГ' not in st and 'АО' not in st and 'ГС' not in st and 'СГ' not in st and \
            'ГП' not in st:
        count += 1

print(count)

Условие:

Решение:
from itertools import product

count = 0
a = 'ОБОРОНА'
ls = list(product(a, repeat=7))
for i in ls:
    st = ''.join(i)
    if 'ААА' in st or 'ААО' in st or 'АОА' in st or 'ОАА' in st or 'ООА' in st or 'ОАО' in st or \
            'ООА' in st or 'ООО' in st or 'ААА' in st:
        count += 1

print(count)

Условие:

Решение:
